-- phpMyAdmin SQL Dump
-- version 4.0.10
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Май 18 2015 г., 18:14
-- Версия сервера: 5.5.35-log
-- Версия PHP: 5.3.27

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- База данных: `is`
--

-- --------------------------------------------------------

--
-- Структура таблицы `alerts`
--

CREATE TABLE IF NOT EXISTS `alerts` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(11) unsigned NOT NULL,
  `title` varchar(255) NOT NULL,
  `text` text NOT NULL,
  `type` varchar(20) NOT NULL,
  `created` datetime NOT NULL,
  `modified` datetime NOT NULL,
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `files`
--

CREATE TABLE IF NOT EXISTS `files` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(11) unsigned NOT NULL,
  `title` varchar(255) NOT NULL,
  `info` varchar(500) NOT NULL,
  `slug` varchar(100) NOT NULL,
  `modified` datetime NOT NULL,
  `created` datetime NOT NULL,
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `menus`
--

CREATE TABLE IF NOT EXISTS `menus` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `key` varchar(100) NOT NULL,
  `name` varchar(100) NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- Дамп данных таблицы `menus`
--

INSERT INTO `menus` (`id`, `key`, `name`) VALUES
(1, 'main', 'Головне');

-- --------------------------------------------------------

--
-- Структура таблицы `menu_items`
--

CREATE TABLE IF NOT EXISTS `menu_items` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `menu_id` int(11) unsigned NOT NULL,
  `item_id` int(11) unsigned DEFAULT NULL,
  `name` varchar(100) NOT NULL,
  `url` text NOT NULL,
  `position` tinyint(3) unsigned NOT NULL,
  PRIMARY KEY (`id`),
  KEY `menu_id` (`menu_id`),
  KEY `item_id` (`item_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=21 ;

--
-- Дамп данных таблицы `menu_items`
--

INSERT INTO `menu_items` (`id`, `menu_id`, `item_id`, `name`, `url`, `position`) VALUES
(1, 1, NULL, 'Головна', '/', 0),
(2, 1, NULL, 'Кафедра', '', 2),
(3, 1, 2, 'Загальна інформація', '/pages/view/kafedra', 1),
(4, 1, 2, 'Викладацький склад', '/users/all', 2),
(5, 1, 2, 'Історична довідка', '/pages/view/istorichna_dovidka', 3),
(6, 1, NULL, 'Наука', '/pages/view/naukova_robota', 3),
(7, 1, NULL, 'Абітурієнту', '', 4),
(8, 1, 7, 'Слово до абітурієнта', '/pages/view/slovo_do_abituriyenta', 1),
(9, 1, 7, 'Спецільності', '/pages/view/speciality', 2),
(10, 1, NULL, 'Студентське життя', '', 5),
(11, 1, 10, 'Гуртожиток', '/pages/view/gurtozhitok', 1),
(12, 1, 10, 'Навчання', '/pages/view/neobhidno_znati', 2),
(13, 1, NULL, 'Література', '', 6),
(14, 1, 13, 'Електронні видання', '/pages/view/elektronni_vidannya', 1),
(15, 1, 13, 'Методички', '', 2),
(16, 1, 13, 'Електронна бібліотека ІС', 'http://library.nuft.edu.ua/ebook/datathree.php?ID=138', 3),
(17, 1, NULL, 'Відгуки', '', 7),
(18, 1, 17, 'Додати', '/reviews', 1),
(19, 1, 17, 'Всі відгуки', '/reviews/all', 2),
(20, 1, NULL, 'Новини', '/news', 1);

-- --------------------------------------------------------

--
-- Структура таблицы `news`
--

CREATE TABLE IF NOT EXISTS `news` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(11) unsigned NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` varchar(500) NOT NULL,
  `content` text,
  `slug` varchar(255) NOT NULL,
  `published` tinyint(1) NOT NULL,
  `modified` datetime NOT NULL,
  `created` datetime NOT NULL,
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `pages`
--

CREATE TABLE IF NOT EXISTS `pages` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(11) unsigned NOT NULL,
  `title` varchar(255) NOT NULL,
  `content` text,
  `slug` varchar(255) NOT NULL,
  `modified` datetime NOT NULL,
  `created` datetime NOT NULL,
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=10 ;

--
-- Дамп данных таблицы `pages`
--

INSERT INTO `pages` (`id`, `user_id`, `title`, `content`, `slug`, `modified`, `created`) VALUES
(1, 1, 'Загальна інформація', '<div class="col-md-4">\r\n<div style="text-align:center;"><img alt="" src="/img/zavkaf.png" /></div>\r\n\r\n<p style="text-align:center; color:#222; font-weight:800">Самсонов Валерій Васильович</p>\r\n\r\n<p style="text-align:center; color:#555">Завідувач кафедри<br />\r\nпрофесор, кандидат технічних наук. Нагороджений Почесною грамотою Кабінету Міністрів України, Почесною грамотою Академії педагогічних наук України, Почесною грамотою Центрального комітету профспілок працівників освіти і науки Україн</p>\r\n\r\n<div class="alert alert-info">(044) 287-93-88<br />\r\n(044) 289-73-16<br />\r\nА-333: (044) 287-92-46<br />\r\nА-338: (044) 287-96-77</div>\r\n</div>\r\n\r\n<div class="col-md-8">\r\n<p style="text-align: center;"><strong>(створена у 2002 році)</strong></p>\r\n\r\n<p>Кафедра інформаційних систем здійснює професійну підготовку фахівців за напрямом &laquo;Комп&#39;ютерні науки&raquo;, спеціалістів і магістрів за спеціальністю &laquo;Інформаційні управляючі системи і технології&raquo; та магістрів за спеціальністю &laquo;Комп&#39;ютерний еколого-економічний моніторинг&raquo;. &nbsp;Узагальненим&nbsp; об&#39;єктом професіональної діяльності майбутніх спеціалістів є інформаційні та автоматизовані системи, засоби контролю, моніторингу і управління, їх математичне, інформаційне, технічне та програмне забезпечення; способи та методи їх проектування, розробки, впровадження, а також експлуатація.</p>\r\n\r\n<p>Практичні навички студенти закріплюють під час проходження практики на підприємствах харчової промисловості, у наукових установах Національної академії наук України, галузевих науково-дослідних інститутах і комерційних установах, де всебічно розширюють та закріплюють отримані під час навчання знання. Це, зокрема, Інститут кібернетики ім. В.М. Глушкова НАН України, Інститут телекомунікацій і глобального простору НАН України, ЗАТ &laquo;Оболонь&raquo;, ЗАТ &laquo;Київські макарони&raquo;, Київський пивзавод на Подолі, хлібокомбінати міста та інші харчові підприємства України. Між кафедрою інформаційних систем і зазначеними науковими установами укладено договори&nbsp; про наукову допомогу в підготовці фахівців, провідні вчені викладають дисципліни професійної підготовки, очолюють наукові дослідження.&nbsp; Кафедра має також договір із Каунаським технологічним університетом Литви про міжнародне співробітництво &ndash; обмін студентами, з провідними фірмами-розробниками програмних засобів, які в процесі проходження студентами практики кращим пропонують роботу. Під час навчання студенти кафедри мають змогу набути знань та досвіду, працюючи адміністраторами комп&rsquo;ютерних лабораторій університету, у відділі технічних засобів навчання та дистанційної освіти, центрі інтелектуальних комп&#39;ютерних систем, Інституті телекомунікацій і глобального інформаційного простору НАН України.</p>\r\n\r\n<p>Для виконання наукових досліджень &ndash; аналізу, моделювання і проектування інформаційних систем використовується п&rsquo;ять комп&#39;ютерних аудиторій, які мають актуальне програмне забезпечення. Для виконання студентами самостійної і науково-дослідної робіт організовано локальну комп&rsquo;ютерну мережу між аудиторіями і з безкоштовним доступом в Internet. Студенти із визначними здібностями приєднуються до науково-дослідної роботи під керівництвом професорів і доцентів кафедри, виступають на конференціях, публікуються у фахових наукових виданнях, розробляють програмні засоби для відділів та служб університету, беруть участь у розробленні і впровадженні електронних засобів навчання. Також студенти кафедри інформаційних систем є активними учасниками всеукраїнських і міжнародних олімпіад з програмування: Міжнародна відкрита студентська олімпіада з програмування імені С.О. Лебедєва та В.М. Глушкова &laquo;KPI-OPEN&raquo; на базі КНТУ &laquo;КПІ&raquo;, Міжнародна Літня школа з програмування, Міжнародна Зимова школа з програмування.</p>\r\n\r\n<p>Колектив кафедри інформаційних систем активно співпрацює з навчальними і науковими установами, зокрема з НУТУ &laquo;КПІ&raquo;, Національним транспортним університетом, Харківським національним університетом радіоелектроніки, Інститутом кібернетики ім. В.М. Глушкова, Державним університетом інформаційно-комунікаційних технологій, ДП&nbsp;НВК &laquo;Київський інститут автоматики&raquo;, Інститутом психології ім. Г. С. Костюка АПН України та іншими закладами, в тому числі і кафедрами університету.&nbsp;</p>\r\n</div>\r\n', 'kafedra', '2015-05-17 03:41:56', '2015-05-17 02:24:10'),
(2, 1, 'Історична довідка', '<p><strong>Кафедра &quot;Інформаційних систем&quot;</strong> заснована у 2002 році. З метою підвищення якості підготовки бакалаврів 6.050101 &laquo;Інформаційні технології&raquo;, спеціалістів і магістрів спеціальності 7.080401 &laquo;Інформаційні управляючі системи та технології&raquo;, а також фахівців вищої кваліфікації &ndash; докторів і кандидатів наук зі спеціальності 05.13.06 &laquo;Інформаційні технології&raquo;, наказом ректора № 122 &nbsp;&laquo;Про зміни в структурі НУХТ&raquo; від 19 вересня 2002 прийнято рішення про створення кафедри Інформаційних систем. За цим рішенням кафедра інформатики у 2002 р. розділилась на дві кафедри: Інформатики й Інформаційних систем. Із створенням кафедри в університеті оформився новий науковий напрямок, пов&#39;язаний з прикладним системним аналізом інформаційних процесів у харчовій галузі.</p>\r\n\r\n<p>Стрімкий розвиток комп&rsquo;ютеризації суспільства сформував необхідність здійснення адміністративного управління на підприємствах харчової галузі з використанням інформаційних технологій. Підготовку фахівців за спеціальністю &laquo;Інформаційні управляючі системи і технології&raquo; було розпочато 1996 році. У 2001 році відбувся перший випуск &nbsp;спеціалістів. У 2002 році спеціальність була акредитована Міністерством освіти і науки України за третім, а згодом і найвищим &ndash; четвертим рівнем акредитації. Згідно цього рівня акредитації кафедра має право здійснювати ступеневу підготовку фахівців за освітньо-кваліфікаційними рівнями &laquo;бакалавр&raquo;, &laquo;спеціаліст&raquo; та &laquo;магістр&raquo; на денну та заочну форму навчання. І весною 2002 року відбувся перший випуск магістрів спеціальності &laquo;Інформаційні управляючі системи і технології&raquo;.</p>\r\n\r\n<p>Виконання обов&rsquo;язків завідувача кафедри з пер&shy;ших днів її існування було покладено на доцента Ельперіна І.В, який на той час був деканом факультету Автоматизації та комп&rsquo;ютерних систем. До новоствореної кафедри увійшли професори Сергій Іванович Сіренко, Володимир Якович Кондращенко, доценти Людмила Юріївна Маноха, Лариса Григорівна Загоровська, Олена Михайлівна М&rsquo;якшило, Ольга Андріївна Хлобистова та інші викладачі. В 2003 році кафедру очолювали професор Віктор Якович Кондращенко і професор Сергій Іванович Сіренко. Науково-дослідна робота кафедри була спрямована на розробку методологічних підходів, алгоритмічних та програмних засобів для інформаційної підтримки рішень в системах управління харчовими підприємствами.</p>\r\n\r\n<p>Кафедру з березня 2004 року і до сьогодні очолює професор Самсонов Валерій Валерійович. Кафедра інформаційних систем здійснює підготовку бакалаврів напряму 6.050101 &nbsp; &quot;Комп&rsquo;ютерні науки&quot;, спеціалістів зі спеціальності 7.05010101 &quot;Інформаційні управляючі системи та технології&quot;, магістрів спеціальностей 8.05010101 &quot;Інформаційні управляючі системи та технології&quot; і 8.05010105 &ldquo;Комп&rsquo;ютерний еколого-економічний моніторинг&rdquo;. А також спеціалістів вищої категорії 05.13.06 &quot;Інформаційні технології&quot;. Варто зазначити, що за цей період кількість викладачів кафедри зросла і у 2013 році становить 30 науково-педагогічних працівників (штатних і за сумісництвом), з яких 5 докторів наук і 15 кандидатів наук. Для організації навчального процесу &ndash; проведення лабораторних робіт, самостійної підготовки, виконання курсових, дипломних та наукових робіт студентів &ndash; використовується п&#39;ять закріплених комп&rsquo;ютерних класів. Починаючи із 2010 року на кафедрі виконано необхідний комплекс заходів з метою підготовки до відкриття нової спеціальності &laquo;Комп&rsquo;ютерний економіко-екологічний моніторинг&raquo;. У 2012 році на кафедрі відбувся перший випуск магістрів за спеціальністю 8.05010105 &laquo;Комп&rsquo;ютерний економіко-екологічний моніторинг&raquo;. &nbsp; &nbsp;&nbsp;</p>\r\n\r\n<p>Фахівець з комп&rsquo;ютерного економіко-екологічного моніторингу має змогу працювати у відділах комп&rsquo;ютеризації харчових підприємств, комп&rsquo;ютерного економіко-екологічного моніторингу, в еколого-експертних підрозділах Міністерства екології, Державної екологічної інспекції, державних управліннях екології й природних ресурсів, відділах екології на підприємствах.</p>\r\n', 'istorichna_dovidka', '2015-05-17 03:30:05', '2015-05-17 03:29:57'),
(3, 1, 'Наукова робота', '<p>Наукова робота є одним з першорядних завдань діяльності професорсько-викладацького складу кафедри. Науково-дослідна робота кафедри інформаційних систем передбачає розроблення методологічних та алгоритмічних підходів, програмних застосунків для інтелектуальної підтримки рішень у системах управління харчовими підприємствами та удосконалення навчального процесу. Співробітники кафедри працюючи над розв&rsquo;язанням наукових проблем:</p>\r\n\r\n<p>- коректні методи ідентифікації реальних об&rsquo;єктів різної природи;</p>\r\n\r\n<p>- знань-орієнтовані інформаційні технології прийняття рішень;</p>\r\n\r\n<p>- моделювання експертних знань на базі логіко-обчислювальної семантичної мережі;</p>\r\n\r\n<p>- розроблення системи прийняття рішень при плануванні оперативних рішень у надзвичайних ситуаціях;</p>\r\n\r\n<p>- розроблення та впровадження систем електронних навчально-методичних ресурсів навчальної дисципліни;</p>\r\n\r\n<p>- дослідження методів аналізу інформації в базах даних підприємств із метою підвищення ефективності його функціонування;</p>\r\n\r\n<p>- дослідження та реалізація методів спільного застосування криптографічного та завадостійкого кодування;</p>\r\n\r\n<p>щорічно публікують &nbsp;близько 25 наукових статей, приймають участь близько 30 міжнародних науково-технічних та науково-практичних конференціях, де виступають з 25-30 доповідями. До переліку входять міжнародні науково-технічні та науково-практичні конференції: &laquo;Комп&rsquo;ютерні системи та мережеві технології (CSNT)&raquo;, &laquo;Системний аналіз та інформаційні технології&raquo;, &laquo;Захист інформації в інформаційно-комунікаційних системах&raquo;, Міжнародна конференція з автоматичного управління, &laquo;Комп&rsquo;ютерні системи та мережеві технології&raquo;, що проводяться у Києві та інших містах України, а також за кордоном.</p>\r\n\r\n<p>Кафедра інформаційних систем бере участь у науково-дослідній роботі університету: проводить наукові дослідження за найважливішими теоретичними, науково-технічними і соціально-економічними проблемами за профілем кафедри, проблемами педагогіки вищої школи у тісному зв&#39;язку із завданнями підвищення якості підготовки спеціалістів; складає щорічні звіти за підсумками НДР; виконує щорічну атестацію аспірантів кафедри; обговорює завершені науково-дослідні роботи і дає рекомендації щодо їх опублікування, бере участь у впровадженні результатів досліджень; розглядає дисертації, які представляються членами кафедри або, за доручення керівництва університету, іншими здобувачами; організовує науково-дослідну роботу студентів; здійснює щорічну підготовку студентів для участі в олімпіадах державного і міжнародного рівня.</p>\r\n\r\n<p>При кафедрі діє студентський науковий гурток &quot;Клубна радіостанція&quot; під керівництвом доцента к.т.н. А.О. Мошенського, напрям роботи якого є телекомунікаційні мережі та передача даних. Між кафедрою інформаційних систем і Каунаським технологічним університетом Литви у 2012 р. заключено договір про міжнародне співробітництво &ndash; обмін студентами з метою їх навчання.</p>\r\n\r\n<p>Щорічно команди студентів різних курсів приймають участь в олімпіадах і школах із програмування різного рівня: внутрішньовузівських і міжнародних. А саме у Міжнародній відкритій студентській олімпіаді з програмування імені С.О. Лєбєдєва та В.М. Глушкова &laquo;KPI-OPEN&raquo; на базі КНТУ &laquo;КПІ&raquo;, Міжнародній літній школі з програмування і Міжнародній зимовій школі програмістів для студентів вищих навчальних закладів.</p>\r\n\r\n<p>В 2006 році кафедра приймала участь в організації Всеукраїнської науково-методичної конференції &laquo;Проблеми і перспективи розвитку вищої технічної вищої технічної освіти в умовах інформатизації &nbsp;суспільства та входження України в Болонський процес&raquo;. Спільно з кафедрою автоматизації комп&#39;ютерно-інтегрованих технологій у 2009 було проведено Науково-технічну конференцію &laquo;Сучасні методи, інформаційне, програмне та технічне забезпечення систем управління організаційно-технічними комплексами&raquo;.</p>\r\n', 'naukova_robota', '2015-05-17 03:31:14', '2015-05-17 03:31:08'),
(4, 1, 'Слово до абітурієнта', '<p><img alt="" src="/img/rektor.jpg" style="width: 300px; height: 400px; float: left; border-width: 0px; border-style: solid; margin: 15px;" />&nbsp;Національний університет харчових технологій &ndash; потужний навчально-науковий комплекс, знаний і глибоко шанований не лише в Україні, але й далеко за її межами. Це єдиний в Україні вищий технічний заклад освіти, у якому здійснюється підготовка висококваліфікованих фахівців різних освітньо-кваліфікаційних рівнів &ndash; від &laquo;молодшого спеціаліста&raquo; до &laquo;магістра&raquo; &ndash; за 215 освітніми програмами для високотехнологічних галузей економіки.</p>\r\n\r\n<p>Історія нашого навчального закладу &ndash; частина історії країни. Вона бере початок у 1884 році, коли при Смілянському рафінадному заводі були відкриті технічні класи &ndash; перший в історії Російської імперії технічний навчальний заклад для підготовки техніків-хіміків і майстрів цукрового виробництва. Вони стали базою для заснування у Києві інституту цукрової промисловості. Він неодноразово змінював назву: Київський інститут цукрової промисловості і Київський інститут технології цукру (1930), Київський хіміко-технологічний інститут харчової промисловості (1933), Київський технологічний інститут харчової промисловості ім. А.І. Мікояна (1935), Український державний університет харчових технологій (1993), Національний університет харчових технологій (2002). Незмінним залишалося лише прагнення колективу на будь-якому етапі історичного розвитку держави готувати спеціалістів найвищого ґатунку, виховувати самовідданих, наполегливих, творчих особистостей, вкладати все своє вміння, всі знання, усю душу у гармонійний розвиток своїх вихованців.</p>\r\n\r\n<p>За роки існування наш навчальний заклад значно розширив палітру напрямів і спеціальностей підготовки і став знаним не лише на теренах колишнього СРСР, а й визнаним авторитетом за кордоном.</p>\r\n\r\n<p>Національний університет харчових технологій &ndash; навчально-науковий комплекс, у якому створений замкнений цикл доуніверситетської, ступеневої та післядипломної підготовки і перепідготовки фахівців. До складу комплексу входять 12 факультетів, 2 Інститути післядипломної освіти, 8 регіональних навчально-наукових центрів і 13 технікумів і коледжів, які розташовані у різних містах України.</p>\r\n\r\n<p>Всього у нашому навчальному комплексі здобувають знання близько 30 тисяч студентів і слухачів. У навчальному процесі задіяні понад 150 докторів наук та професорів, більше 480 кандидатів наук. Серед них 21 член НАН України та галузевих академій, 19 лауреатів Державної премії України, 16 заслужених діячів науки і техніки та заслужених працівників освіти.</p>\r\n\r\n<p>До послуг студентів &ndash; науково-технічна бібліотека, яка розташована в окремому корпусі і має понад 1 млн.210 тис. примірників друкованих видань, їдальні та буфети, студентські спортивно-оздоровчі табори на Чорному морі та в Прикарпатті, студмістечко, яке об&rsquo;єднує шість гуртожитків, навчально-спортивний комплекс із сучасним басейном.</p>\r\n\r\n<p>В університеті створені всі умови для творчого та фізичного розвитку студентів. Працюють численні гуртки художньої самодіяльності, творчі колективи, спортивні секції, Центр культурного та естетичного виховання.</p>\r\n\r\n<p>Невпинно плине час. Залишилися в минулому майже 130 років пошуків, наполегливої, натхненної праці, перемог. Історія університету &ndash; історія визначних досягнень і незаперечних успіхів, і вона спонукає до конструктивних дій. Сьогодення &ndash; час для повного розкриття кожної особистості відповідно до її покликання, обдарованості, здібностей. У Національному університеті харчових технологій є всі умови для такого розкриття, наші педагоги виховують інтелектуальну еліту суспільства. Потужні науково-педагогічні школи, висококваліфіковані викладацькі кадри, модернізована навчальна база, широке використання новітніх інформаційних технологій дають можливість готувати високоякісних фахівців, широко затребуваних на ринку праці не лише України.</p>\r\n\r\n<p>Колектив університету постійно знаходиться на вістрі науково-технічного прогресу. Яскравим свідченням цього є визнання його наукових досягнень як в Україні, так і за її межами.</p>\r\n\r\n<p>Випускники нашого навчального закладу пригадують студентські роки, як найщасливіші роки свого життя. Де б вони не жили (а в нашому навчальному закладі за час його існування підготовлено тисячі спеціалістів для багатьох країн світу), де б не працювали, вони пам&rsquo;ятають свою Аlma Mater і пишаються тим, що навчались у київському харчовому.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<table align="center" border="0" cellpadding="1" cellspacing="1" style="width:90%">\r\n	<tbody>\r\n		<tr>\r\n			<td><strong>Щиро ваш,<br />\r\n			в.о. ректора університету,<br />\r\n			доктор технічних наук, професор</strong><br />\r\n			&nbsp;</td>\r\n			<td><strong>А. Українець</strong></td>\r\n		</tr>\r\n	</tbody>\r\n</table>', 'slovo_do_abituriyenta', '2015-05-17 03:45:18', '2015-05-17 03:44:11');
INSERT INTO `pages` (`id`, `user_id`, `title`, `content`, `slug`, `modified`, `created`) VALUES
(5, 1, 'Спеціальності', '<p>На <strong>факультеті автоматизації і комп&rsquo;ютерних систем</strong> можна навчатися на денній або заочній формі навчання.</p>\r\n\r\n<p>Підготовка бакалаврів здійснюється за двома напрямами:</p>\r\n\r\n<ul>\r\n	<li><strong><span style="line-height: 1.7em;">6.050202 &ldquo;Автоматизація та комп&rsquo;ютерно-інтегровані технології&rdquo; ;</span></strong></li>\r\n	<li><strong><span style="line-height: 1.7em;">6.050101 &ldquo;Комп&rsquo;ютерні науки&rdquo;.</span></strong></li>\r\n</ul>\r\n\r\n<p>Навчання освітньо-кваліфікаційного рівня <strong>&laquo;бакалавр&raquo;</strong> денної форми &nbsp;триває 4 роки, заочної форми навчання &ndash; 4,5 роки. Випускники технікумів і коледжів відповідного профілю можуть навчатися за скороченою формою навчання, яка триває 2,5 роки.</p>\r\n\r\n<p>По закінченню підготовки <strong>бакалаврів з напряму 6.050202 &ldquo;Автоматизація та комп&rsquo;ютерно-інтегровані технології&rdquo;</strong> студенти отримують кваліфікацію молодшого інженера з автоматизації і комп&rsquo;ютерних технологій. Продовження навчання для отримання освітньо-кваліфікаційного рівня спеціаліста або магістра може відбуватись за двома спеціальностями:</p>\r\n\r\n<ul>\r\n	<li><strong><span style="line-height: 1.7em;">7.092501 (8.092501) &ldquo;Автоматизоване управління технологічними процесами&rdquo;;</span></strong></li>\r\n	<li><strong><span style="line-height: 1.7em;">7.092502 (8.092502) &ldquo;Комп&rsquo;ютерно-інтегровані технологічні процеси та виробництва&rdquo;.</span></strong></li>\r\n</ul>\r\n\r\n<p>Для спеціальності &ldquo;Комп&rsquo;ютерно-інтегровані технологічні процеси та виробництва&rdquo; існує <strong>спеціалізація 7.092502.01 &ldquo;Автоматизоване управління бізнес-процесами виробництв&rdquo;.</strong></p>\r\n\r\n<p>Після закінчення підготовки <strong>бакалаврів з напрямку 6.050101 &ldquo;Комп&rsquo;ютерні науки&rdquo;</strong> студенти отримують <strong>кваліфікацію інженера-програміста.</strong> Продовження навчання для отримання освітньо-кваліфікаційного рівня спеціаліста або магістра відбувається за спеціальністями:</p>\r\n\r\n<ul>\r\n	<li><strong><span style="line-height: 1.7em;">7.05010101 (8.05010101) &ldquo;Інформаційні управляючі системи та технології&rdquo;;</span></strong></li>\r\n	<li><strong><span style="line-height: 1.7em;">​</span><span style="line-height: 1.7em;">8.05010105 &laquo;Комп&rsquo;ютерний еколого-економічний моніторинг&raquo;.</span></strong></li>\r\n</ul>\r\n\r\n<p>Навчання освітньо-кваліфікаційного рівня <strong>&laquo;спеціаліст&raquo;</strong> на базі ОКР &laquo;бакалавр&raquo; денної і заочної форм триває 1 рік.</p>\r\n\r\n<p>Навчання освітньо-кваліфікаційного рівня <strong>&laquo;магістр&raquo;</strong> на базі ОКР &laquo;бакалавр&raquo; денної і заочної форми триває 1 рік.</p>\r\n\r\n<p>Неможливо сьогодні уявити сучасне виробництво без високого рівня автоматизації і комп&rsquo;ютеризації всіх його ділянок. Це зумовлене бажанням не лише полегшити роботу працівникам, а й отримати конкурентноспроможну продукцію високої якості. Оскільки харчова промисловість, до складу якої входять десятки тисяч підприємств різноманітного профілю, є одною з провідних в Україні, то впровадження новітніх інформаційних технологій та сучасних систем управління тут відбувається особливо інтенсивно.</p>\r\n\r\n<p>Для вирішення цих задач потрібні <strong>фахівці з автоматизації, комп&rsquo;ютерно-інтегрованих технологій та інформаційних управляючих систем, підготовку яких здійснює факультет &laquo;Автоматизації та комп&rsquo;ютерних систем&raquo;</strong> за двома освітніми напрямами за ОРК: бакалавр &ndash; спеціаліст або магістр.</p>\r\n\r\n<p>Підготовка бакалаврів з напрямом <strong>&laquo;Автоматизації та комп&rsquo;ютерно-інтегрованих технологій&raquo;</strong> проводиться 4 роки. Після закінчення цього освітнього рівня студенти отримують кваліфікацію молодшого інженера з автоматизації і комп&rsquo;ютерних технологій. Продовження навчання для отримання освітньо-кваліфікаційного рівня спеціаліста може відбуватись за двома спеціальностями: &laquo;Автоматизоване управління технологічними процесами&raquo; і &laquo;Комп&rsquo;ютерно-інтегровані технологічні процеси та виробництва&raquo;. Для другої спеціальності існує також спеціалізація &ndash; &laquo;Автоматизоване управління бізнес-процесами виробництв&raquo;.</p>\r\n\r\n<p>Основними напрямками майбутньої професійної діяльності студентів, які продовжують навчання за спеціальністю <strong>&laquo;Автоматизоване управління технологічними процесами&raquo;</strong>, є робота в царині створення та експлуатації систем автоматизації технологічних процесів, установок та агрегатів, які забезпечують підтримку обраного режиму функціонування. По закінченню навчання випускники мають можливість займати посади керівників та провідних спеціалістів, головних метрологів, інженерів з автоматизації, інженерів проектантів систем автоматизації, менеджерів проектів, інженерів з налагодження систем автоматизації. Це класична спеціальність з автоматизації підготовка фахівців з якої в університеті має більш ніж 40-річну історію.</p>\r\n\r\n<p>Фахівці зі спеціальності <strong>&laquo;Комп&rsquo;ютерно-інтегровані технологічні процеси та виробництва&raquo;</strong>, підготовку яких вперше в Україні розпочато у 1995 році, зорієнтовані на розроблення та експлуатацію комп&rsquo;ютерно-інтегрованих систем управління з використанням інтелектуальних підсистем підтримки прийняття рішень на основі баз даних та знань і систем управління ними. Такий майбутній професійний характер діяльності вимагає поєднання класичної інженерної освіти в галузі автоматизації з поглибленим опануванням комп&rsquo;ютерних технологій та спеціального програмного забезпечення. Фахівці з цієї спеціальності займають інженерно-технічні посади, які забезпечують проектування та функціонування автоматизованих систем управління виробництвом на базі широкого використання комп&rsquo;ютерно-інтегрованих технологій.</p>\r\n\r\n<p>Науково-технічний прогрес у промисловості базується на розвитку ряду напрямів, серед яких важливим є інтеграція виробничих процесів та управління ними. У зв&#39;язку з цим, для даної спеціальності відкрито спеціалізацію <strong>&quot;Автоматизоване управління бізнес-процесами підприємства&quot;</strong>. Студенти цієї спеціалізації вивчають цикл дисциплін, пов&#39;язаних з економічною діяльністю підприємств таких, наприклад, як фінанси, бухгалтерський облік, основи маркетингу, мікро- та макроекономіка, аудит і контролінг, основи ціноутворення, основи зовнішніх економічних відносин та ін., а також спеціалізоване програмне забезпечення. Після закінчення університету випускники мають можливість займати посади інженерів і головних спеціалістів з автоматизації, інженерів з розробки алгоритмів та програм для інтегрованих систем управління, системних аналітиків проектів, інженерів проектантів, менеджерів, спеціалістів з комп&#39;ютерних технологій.</p>\r\n\r\n<p>Безумовно, розглянуті спеціальності і спеціалізації є спорідненими. Їх навчальні плани мають 70% загальних дисциплін, які формують класичні вимоги до підготовки фахівців в галузі автоматизації, але наявність декількох спеціальностей і спеціалізацій дозволяє готувати спеціалістів, рівень знань і кваліфікація &nbsp;яких найбільш повно відповідає сучасним вимогам.</p>\r\n\r\n<p>Слід зауважити, що за останні десять років принципи побудови систем автоматизації зазнали суттєвих змін. На зміну традиційним технічним засобам автоматизації прийшли сучасні мікропроцесорні управляючі пристрої та комп&rsquo;ютерно-інтегровані технології. Саме тому, при підготовці спеціалістів з автоматизації особлива увага приділяється вивченню сучасних технічних засобів автоматизації і спеціалізованого програмного забезпечення. Лабораторії кафедри АКІТ найкраще серед ВНЗ України оснащені мікропроцесорними контролерами. Устаткування для навчальних лабораторій кафедри поставили лідери в галузі мікропроцесорних технічних засобів автоматизації &ndash; фірми Schneider Electric, Mitsubishi, Siemens, VIPA, OBEH, Мікрол та інші. Отже студенти мають можливість не тільки вивчати теоретично, а й отримувати практичні навички роботи з сучасним технічним та програмним забезпеченням . Кращі студенти, разом з дипломом отримують сертифікати, які підтверджують високий рівень їх підготовки до роботи з окремими типами технічних засобів автоматизації.</p>\r\n\r\n<p>Спеціальність <strong>&laquo;Інформаційні управляючі системи та технології&raquo;</strong> належить до напряму <strong>&laquo;Комп&rsquo;ютерні науки&raquo;</strong>. ХХІ сторіччя проголошено добою інформаційної революції &ndash; глибокого проникнення комп&rsquo;ютерних технологій в усі сфери життєдіяльності людини. Інформаційні технології (ІТ) розвиваються так швидко, що не лише в Україні, але й у інших країнах світу відчувається дефіцит спеціалістів цієї галузі.</p>\r\n\r\n<p>Об&rsquo;єктом діяльності ІТ спеціаліста є інформаційні управляючі системи (ІУС) для підприємств, установ і організацій. Профіль майбутньої роботи &ndash; розробка, впровадження та експлуатація названих систем, які забезпечують управління, інформаційну підтримку, підтримку прийняття рішень як для окремих підрозділів підприємства, так і підприємства або корпорації в цілому.</p>\r\n\r\n<p>Застосування навчальних сучасних технологій, широке впровадження засобів та програмних пакетів моделювання та проектування, активне застосування новітніх досягнень у галузях інформаційних технологій дозволяють готувати фахівців на рівні світових вимог. Майбутні фахівці поглиблено вивчають мови програмування, схемотехніку, архітектуру комп&rsquo;ютерів, системне програмування та операційні системи, теорію прийняття рішень, бази даних, системний аналіз, сучасну теорія управління, засоби проектування інтелектуальних систем, комп&rsquo;ютерні мережі, WEB-технології, засоби мультимедіа, CASE-технології проектування систем, тощо.</p>\r\n\r\n<p>Фахівець може працювати розробником ІТ систем, спеціалістом по експлуатації та супроводженню програмного забезпечення, інженером-програмістом, аналітиком комп&rsquo;ютерних систем, WEB-спеціалістом, адміністратором баз даних, адміністратором систем, інженером автоматизованих систем керування виробництвом, прикладним програмістом.</p>\r\n\r\n<p>Випускники цілком підготовлені до роботи у комп&rsquo;ютерних відділах промислових підприємств, наукових, конструкторських, проектних організаціях, комерційних фірмах та банківських установах. Фахівець може застосовувати свої знання практично в усіх сферах виробничої та невиробничої діяльності людини, де використовують комп&rsquo;ютерні технології.</p>\r\n\r\n<p>Студентське життя це не тільки роки навчання, а й найяскравіші моменти спілкування, які збережуться на довгі роки. Свої таланти студенти можуть розвивати в гуртках художньої самодіяльності, в клубі веселих і дотепних, змаганнях з брейн-рингу. Усі охочі можуть відвідувати спортивні секції спорткомплексу НУХТ. На базі факультетського гуртожитку функціонує спортивна кімната. У гуртожитку працює філія бібліотеки. Всі кімнати гуртожитку підключені до мережі підключені до мережі Internet.</p>\r\n\r\n<p>Випускники всіх спеціальностей факультету мають дуже добрі перспективи працевлаштування на престижну, високооплачувану роботу, оскільки їх кваліфікація має універсальний характер.</p>\r\n', 'speciality', '2015-05-17 03:46:21', '2015-05-17 03:46:06'),
(6, 1, 'Гуртожиток', '<p>Гуртожиток №4</p>\r\n\r\n<p>Київ, проспект&nbsp; Науки 36</p>\r\n\r\n<p>Тел. 525-01-70</p>\r\n\r\n<p><strong><em>Завідувач </em></strong>&ndash; Шеменюк Наталія Віталіївна</p>\r\n\r\n<p style="text-align:left"><iframe frameborder="0" height="450" src="https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d2543.5305700081703!2d30.530794800000002!3d50.39394889999999!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x40d4c8ad51b996ff%3A0xb810cb7d7dfc7ea8!2z0L_RgNC-0YHQvy4g0J3QsNGD0LrQuCwgMzYsINCa0LjRl9CyLCDQvNGW0YHRgtC-INCa0LjRl9Cy!5e0!3m2!1sru!2sua!4v1410814686202" style="border:0" width="600"></iframe></p>\r\n', 'gurtozhitok', '2015-05-17 03:47:27', '2015-05-17 03:47:14'),
(7, 1, 'Необхідно знати', '<h2 style="text-align: center;">Методи викладання і навчання</h2>\r\n\r\n<p>Навчальні семестри поділені на 2 чверті. У кожній чверті студент вивчає не більше шести дисциплін. Вивчення дисципліни може тривати одну чверть або кілька. Зміст кожної дисципліни поділений на модулі. Кожний змістовний модуль є логічно завершеною, системно впорядкованою і структурованою за окремими навчальними елементами частиною теоретичних знань та практичних умінь і навичок навчальної дисципліни. Кількість модулів визначається з урахуванням обсягу навчальної дисципліни. Для дисциплін, які вивчаються протягом 1 чверті:</p>\r\n\r\n<p>1,0 &ndash; 1,5 кредиту &ndash; 2 модулі;</p>\r\n\r\n<p>2,0 &ndash; 2,5 кредиту &ndash; 3 модулі.</p>\r\n\r\n<p>Для дисциплін, які вивчаються протягом 2-х чвертей і мають обсяги 2,0 &ndash; 2,5 кредиту &ndash; 4 або 5 модулів.</p>\r\n\r\n<p>Для дисциплін, які вивчаються протягом 3-х і більше чвертей &ndash; 2 або 3 модулі у кожній чверті.</p>\r\n\r\n<p>Кожний модуль оцінюється визначеною кількістю балів. Рейтингове оцінювання виконання студентами окремих елементів модулів проводиться на лекціях, на лабораторних заняттях (захист лабораторних робіт, тестування); на практичних або семінарських заняттях (письмові контрольні роботи за окремими модулями, тестування, виступи); під час перевірки домашніх завдань; під час захисту курсового проекту (роботи) в кафедральній комісії; під час перевірки звіту з практики або під час проведення підсумкового модульного контролю у вигляді іспиту (не більше 40 балів із 100). Кількість іспитів у семестрі допускається не більше трьох.</p>\r\n\r\n<p>Кількість курсових проектів (робіт) у семестрі не більше двох.</p>\r\n\r\n<p>На четвертому курсі за освітньо-кваліфікаційним рівнем &ldquo;бакалавр&rdquo; денної форми підготовки передбачено проведення проектно-технологічної практики протягом 4-х тижнів та переддипломної практики протягом 2-х тижнів. Після проходження практики студент складає звіт та захищає результати перед кафедральною комісією.</p>\r\n\r\n<p>По закінченню навчання за освітньо-кваліфікаційним рівнем &ldquo;бакалавр&rdquo; студент виконує та захищає бакалаврський дипломний проект, якому передує дипломне проектування тривалістю 7 тижнів.</p>\r\n\r\n<p>На п&rsquo;ятому курсі навчання за освітньо-кваліфікаційним рівнем &ldquo;спеціаліст&rdquo; денної форми підготовки передбачено проведення конструкторської практики протягом 4-х тижнів та переддипломної практики протягом 2-х тижнів.</p>\r\n\r\n<p>Навчання за освітньо-кваліфікаційним рівнем &ldquo;спеціаліст&rdquo; закінчується захистом дипломної роботи (проекту).</p>\r\n\r\n<p>Навчання за освітньо-кваліфікаційним рівнем &ldquo;магістр&rdquo; закінчується захистом магістерської роботи.</p>\r\n\r\n<h2 style="text-align: center;">Шкала та критерії виставлення оцінок</h2>\r\n\r\n<p style="text-align: left;">Кредитно-модульна система передбачає запровадження рейтингової системи оцінювання знань студентів і шкалу за єдиними критеріями відповідно до таблиці</p>\r\n\r\n<p style="text-align: left;">&nbsp;</p>\r\n\r\n<table border="1" cellpadding="0" cellspacing="0" style="line-height: 20.3999996185303px; width: 857px;">\r\n	<tbody>\r\n		<tr>\r\n			<td style="text-align: center;" valign="top" width="50">\r\n			<p><span><strong>За &nbsp;ECTS</strong></span></p>\r\n			</td>\r\n			<td style="text-align: center;" valign="top" width="225">\r\n			<p><strong>За національною шкалою</strong></p>\r\n			</td>\r\n			<td style="text-align: center;" valign="top" width="169">\r\n			<p>&gt;<strong>За шкалою університету&nbsp;(в балах)</strong></p>\r\n			</td>\r\n		</tr>\r\n		<tr>\r\n			<td style="text-align: center;" valign="top" width="50">\r\n			<p align="center"><span style="color: rgb(51, 153, 102);"><strong>А</strong></span></p>\r\n			</td>\r\n			<td style="text-align: center;" valign="top" width="225">\r\n			<p><span style="color: rgb(255, 102, 0);"><strong>Відмінно</strong></span></p>\r\n			</td>\r\n			<td style="text-align: center;" valign="top" width="169">\r\n			<p align="center"><strong><span style="color: rgb(51, 102, 255);">90-100</span></strong></p>\r\n			</td>\r\n		</tr>\r\n		<tr>\r\n			<td style="text-align: center;" valign="top" width="50">\r\n			<p align="center"><span style="color: rgb(51, 153, 102);"><strong>BC</strong></span></p>\r\n			</td>\r\n			<td style="text-align: center;" valign="top" width="225">\r\n			<p><span style="color: rgb(255, 102, 0);"><strong>Добре</strong></span></p>\r\n			</td>\r\n			<td style="text-align: center;" valign="top" width="169">\r\n			<p align="center"><strong><span style="color: rgb(51, 102, 255);">75-89</span></strong></p>\r\n			</td>\r\n		</tr>\r\n		<tr>\r\n			<td style="text-align: center;" valign="top" width="50">\r\n			<p align="center"><span style="color: rgb(51, 153, 102);"><strong>DE</strong></span></p>\r\n			</td>\r\n			<td style="text-align: center;" valign="top" width="225">\r\n			<p><span style="color: rgb(255, 102, 0);"><strong>Задовільно</strong></span></p>\r\n			</td>\r\n			<td style="text-align: center;" valign="top" width="169">\r\n			<p align="center"><strong><span style="color: rgb(51, 102, 255);">60-74</span></strong></p>\r\n			</td>\r\n		</tr>\r\n		<tr>\r\n			<td style="text-align: center;" valign="top" width="50">\r\n			<p align="center"><span style="color: rgb(51, 153, 102);"><strong>FX</strong></span></p>\r\n			</td>\r\n			<td style="text-align: center;" valign="top" width="225">\r\n			<p><span style="color: rgb(255, 102, 0);"><strong>Незадовільно&nbsp;</strong></span><span style="color: rgb(255, 102, 0);"><strong>з можливістю повторного складання</strong></span></p>\r\n			</td>\r\n			<td style="text-align: center;" valign="top" width="169">\r\n			<p align="center"><strong><span style="color: rgb(51, 102, 255);">35-59</span></strong></p>\r\n			</td>\r\n		</tr>\r\n		<tr>\r\n			<td style="text-align: center;" valign="top" width="50">\r\n			<p align="center"><span style="color: rgb(51, 153, 102);"><strong>F</strong></span></p>\r\n			</td>\r\n			<td style="text-align: center;" valign="top" width="225">\r\n			<p><span style="color: rgb(255, 102, 0);"><strong>Незадовільно&nbsp;</strong><span style="color: rgb(255, 102, 0);"><strong>з обов&rsquo;язковим повторним курсом</strong></span></span></p>\r\n			</td>\r\n			<td style="text-align: center;" valign="top" width="169">\r\n			<p align="center"><strong><span style="color: rgb(51, 102, 255);">1-34</span></strong></p>\r\n			</td>\r\n		</tr>\r\n	</tbody>\r\n</table>\r\n\r\n<p style="line-height: 20.3999996185303px; text-align: center;">&nbsp;</p>\r\n\r\n<h2 style="line-height: 20.3999996185303px; text-align: center;">Критерії оцінювання знань студентів</h2>\r\n\r\n<ul>\r\n	<li style="line-height: 20.3999996185303px;">Оцінка <strong>&ldquo;Відмінно&rdquo;</strong> ставиться за тверді знання даної теми. Студент правильно і повно відповідає на теоретичні питання, самостійно і правильно формулює постановку задачі, виконує формалізацію, будує логічні відношення та програму відповідно до змісту типових задач, впевнено працює з інструментальними засобами та володіє основами мови програмування для побудови задач .</li>\r\n	<li style="line-height: 20.3999996185303px;">Оцінка <strong>&ldquo;Добре&rdquo; </strong>ставиться за тверді знання даної теми. У відповідях можуть мати місце окремі неточності. Основні етапи розв&#39;язку типових задач курсу розуміються і виконуються студентом правильно.</li>\r\n	<li style="line-height: 20.3999996185303px;">Оцінка <strong>&ldquo;Задовільно&rdquo;</strong> ставиться за знання даної теми. Студент має загальні уяви про основні етапи та механізми розв&#39;язку типових задач. У відповідях присутні помилки, які студент у змозі виправити за допомогою викладача.</li>\r\n	<li style="line-height: 20.3999996185303px;">Оцінка <strong>&ldquo;Незадовільно&rdquo;</strong> ставиться за незнання основних розділів курсу та механізмів розв&lsquo;язку основних задач, невміння Їх використовувати для вирішення типових задач.</li>\r\n</ul>\r\n', 'neobhidno_znati', '2015-05-17 03:48:32', '2015-05-17 03:48:28'),
(8, 1, 'Електронні видання', '<p><span style="color: inherit; font-family: inherit; font-size: 22px; font-weight: 600; line-height: 24px;">Управління ІТ проектами:</span></p>\r\n\r\n<ol>\r\n	<li>Управління ІТ проектами [Електронний ресурс] : лабораторний практикум для студентів напряму підготовки 6.050101 &quot;Комп&#39;ютерні науки&quot; денної та заочної форм навч. / уклад. О. А. Хлобистова, М. В. Гладка. - К. : НУХТ, 2013. &ndash; 108 с. <a href="http://library.nuft.edu.ua/ebook/datathree.php?ID=138">http://library.nuft.edu.ua/ebook/datathree.php?ID=138</a></li>\r\n	<li>Управління ІТ проектами [Електронний ресурс] : методичні рекомендації до виконання курсової роботи для студентів напряму підготовки 6.050101 &laquo;Комп&quot;ютерні науки&raquo; денної та заочної форм навч. / уклад. М. В. Гладка, О. А. Хлобистова. &ndash; К. : НУХТ, 2014.&ndash; 91 с. &nbsp;<a href="http://library.nuft.edu.ua/ebook/datathree.php?ID=138">http://library.nuft.edu.ua/ebook/datathree.php?ID=138</a></li>\r\n</ol>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p><span style="color: inherit; font-family: inherit; font-size: 22px; font-weight: 600; line-height: 24px;">Інформаційно-обчислювальні комплекси та АСУ:</span></p>\r\n\r\n<ol>\r\n	<li>Інформаційно-обчислювальні комплекси та АСУ [Електронний ресурс] : методичні рекомендації до виконання лабораторних робіт для студентів напряму підготовки 6.050101 &quot;Комп&#39;ютерні науки&quot; усіх форм навч. / уклад. О. А. Хлобистова, М. В. Гладка, К. Є. Бобрівник. - К. : НУХТ, 2012. &ndash; 83 с. <a href="http://library.nuft.edu.ua/ebook/datathree.php?ID=138">http://library.nuft.edu.ua/ebook/datathree.php?ID=138</a></li>\r\n	<li>Інформаційно-обчислювальні комплекси та АСУ [Електронний ресурс] : навчальний посібник / уклад. О. А. Хлобистова, М. В. Гладка, К. Є. Бобрівник. - К. : НУХТ, 2013. &ndash; 178 с. &nbsp;<a href="http://library.nuft.edu.ua/ebook/datathree.php?ID=138">http://library.nuft.edu.ua/ebook/datathree.php?ID=138</a></li>\r\n</ol>\r\n\r\n<p style="line-height: 20.3999996185303px;">&nbsp;</p>\r\n\r\n<p style="line-height: 20.3999996185303px;"><span style="color: inherit; font-family: inherit; font-size: 22px; font-weight: 600; line-height: 24px;">Технології комп&#39;ютерного проектування:</span></p>\r\n\r\n<ol>\r\n	<li style="line-height: 20.3999996185303px;">Технології комп&#39;ютерного проектування [Електронний ресурс] : лабораторний практикум для студентів напряму підготовки 6.050101 &quot;Комп&#39;ютерні науки&quot; денної та заочної форм навч / уклад. О. А. Хлобистова, М. В. Гладка. - К. : НУХТ, 2013. &ndash; 136 с. <a href="http://library.nuft.edu.ua/ebook/datathree.php?ID=138​">http://library.nuft.edu.ua/ebook/datathree.php?ID=138</a></li>\r\n</ol>\r\n\r\n<p style="line-height: 20.3999996185303px;">&nbsp;</p>\r\n\r\n<p style="line-height: 20.3999996185303px;"><span style="color: inherit; font-family: inherit; font-size: 22px; font-weight: 600; line-height: 24px;">Технології захисту інформації:</span></p>\r\n\r\n<ol>\r\n	<li style="line-height: 20.3999996185303px;">Хлобистова, О. А. Технології захисту інформації [Електронний ресурс] : навчальний посібник / уклад. О. А. Хлобистова, Ю. Г. Савченко, М. В. Гладка. &ndash; К. : НУХТ, 2014. &ndash; 84 с. <a href="http://library.nuft.edu.ua/ebook/datathree.php?ID=138​">http://library.nuft.edu.ua/ebook/datathree.php?ID=138</a></li>\r\n</ol>\r\n\r\n<p style="line-height: 20.3999996185303px;">&nbsp;</p>\r\n\r\n<p style="line-height: 20.3999996185303px;"><span style="color: inherit; font-family: inherit; font-size: 22px; font-weight: 600; line-height: 24px;">Основи патентознавства:</span></p>\r\n\r\n<ol>\r\n	<li style="line-height: 20.3999996185303px;">Основи патентознавства [Електронний ресурс] : методичні рекомендації до практичних занять для студентів спеціальностей 8.05010101, 7.05010101 &laquo;Інформаційні управляючі системи і технології&raquo;, 8.05010105 &laquo;Комп`ютерний еколого-економічний моніторинг&raquo;, денної та заочної форм навчання / уклад. О. А. Хлобистова, М. В. Гладка. &ndash; К. : НУХТ, 2014. &ndash; 30 с. <a href="http://library.nuft.edu.ua/ebook/datathree.php?ID=138​">http://library.nuft.edu.ua/ebook/datathree.php?ID=138</a></li>\r\n</ol>\r\n\r\n<p style="line-height: 20.3999996185303px;">&nbsp;</p>\r\n\r\n<p style="line-height: 20.3999996185303px;"><span style="color: inherit; font-family: inherit; font-size: 22px; font-weight: 600; line-height: 24px;">Технологія створення програмних продуктів:</span></p>\r\n\r\n<ol>\r\n	<li style="line-height: 20.3999996185303px;">Технологія створення програмних продуктів [Електронний ресурс] : лабораторний практикум для студентів напряму підготовки 6.050101 &laquo;Комп&#39;ютерні науки&raquo; денної та заочної форм навч. / уклад. : В. А. Литвинов, М. В. Гладка, О. А. Хлобистова. &ndash; К. : НУХТ, 2014. <a href="http://library.nuft.edu.ua/ebook/datathree.php?ID=138​">http://library.nuft.edu.ua/ebook/datathree.php?ID=138</a></li>\r\n</ol>\r\n\r\n<p style="line-height: 20.3999996185303px;">&nbsp;</p>\r\n\r\n<p style="line-height: 20.3999996185303px;"><span style="color: inherit; font-family: inherit; font-size: 22px; font-weight: 600; line-height: 24px;">Об&#39;єктно-орієнтоване програмування:</span></p>\r\n\r\n<ol>\r\n	<li style="line-height: 20.3999996185303px;">Об&#39;єктно-орієнтоване програмування [Електронний ресурс] : методичні рекомендації до виконання курсової роботи для студентів напряму підготовки 6.050101 &laquo;Комп&#39;ютерні науки&raquo; заочної форми навчання / уклад. М. В. Гладка, М. О. Кіктєв, Р. О. Бойко. &ndash; К. : НУХТ, 2014.&ndash; 58 с. <a href="http://library.nuft.edu.ua/ebook/datathree.php?ID=138​">http://library.nuft.edu.ua/ebook/datathree.php?ID=138​</a></li>\r\n</ol>\r\n', 'elektronni_vidannya', '2015-05-17 03:49:34', '2015-05-17 03:49:28'),
(9, 1, 'Вітання завідуючого кафедри', '<h2 style="text-align: center;">Дорогі друзі!</h2>\r\n\r\n<p>​<img alt="" src="/img/zavkaf.png" style="width: 200px; height: 280px; float: left; margin-right: 20px; margin-left: 20px;" />Радий вітати Вас на сайті кафедри &quot;Інформаційних систем&quot; і сподіваюся, що тут Ви знайдете для себе багато різноманітної інформації, що буде корисна і викладачам, і співробітникам та студентам, і абітурієнтам і їхнім батькам та випускникам нашого університету!</p>\r\n\r\n<p>Зараз Ви опинилися &nbsp;перед вибором, який можливо визначить ваше подальше життя - ким стати, яку спеціальність вибрати? Перед вами безліч доріг, і я щиро бажаю, щоб, вибравши свою, ви йшли по ній до кінця, не знаючи розчарування і утоми! Студентське життя повне турбот і хвилювань, але немає часу прекрасніше, чим студентська пора.</p>\r\n\r\n<p>Перед вами відкриваються великі перспективи. Ви будете навчатися за спеціально розробленими програмами, вести наукові дослідження під керівництвом досвідчених викладачів, брати участь у цікавих молодіжних проектах і впроваджувати їх у реальне життя.</p>\r\n\r\n<p>Завдання кафедри - підготовка кваліфікованих фахівців в галузі інформаційних управляючих систем та технологій, які користуються попитом на ринку праці, професійно компетентних, конкурентоздатних та успішних у житті; створення механізмів, здатних підняти якість освіти; створення якісно нових, адекватних сучасним вимогам умов навчання.</p>\r\n\r\n<p>Упевнений, що попереду у вас багато сміливих відкриттів й особистих перемог. Бажаю, щоб кожен новий навчальний рік наближав вас до головної мети - знайти своє місце в житті.</p>\r\n', 'main', '2015-05-18 05:21:29', '2015-05-18 05:19:55');

-- --------------------------------------------------------

--
-- Структура таблицы `reviews`
--

CREATE TABLE IF NOT EXISTS `reviews` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `name` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `text` text NOT NULL,
  `published` tinyint(1) NOT NULL,
  `user_id` int(11) unsigned DEFAULT NULL,
  `created` datetime NOT NULL,
  `modified` datetime NOT NULL,
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8 AUTO_INCREMENT=1 ;

-- --------------------------------------------------------

--
-- Структура таблицы `users`
--

CREATE TABLE IF NOT EXISTS `users` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `hash_id` varchar(100) NOT NULL,
  `login` varchar(100) NOT NULL,
  `password` varchar(100) NOT NULL,
  `role` varchar(15) NOT NULL,
  `created` datetime NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- Дамп данных таблицы `users`
--

INSERT INTO `users` (`id`, `hash_id`, `login`, `password`, `role`, `created`) VALUES
(1, '6e7b0dfcba5470143d644cdcb7b1e89c', 'admin', '$2a$10$/NhL8dUQ/S4UC6Uf66KGWuiddn0rNIyxCgOXHyW0VLHVpxTXnDwa6', 'admin', '2015-05-17 01:13:39');

-- --------------------------------------------------------

--
-- Структура таблицы `users_information`
--

CREATE TABLE IF NOT EXISTS `users_information` (
  `id` int(11) unsigned NOT NULL AUTO_INCREMENT,
  `user_id` int(11) unsigned NOT NULL,
  `email` varchar(100) DEFAULT NULL,
  `name` varchar(255) DEFAULT NULL,
  `post` varchar(255) DEFAULT NULL,
  `contact` varchar(255) DEFAULT NULL,
  `content` text,
  `photo` varchar(100) DEFAULT NULL,
  `modified` datetime NOT NULL,
  PRIMARY KEY (`id`),
  KEY `user_id` (`user_id`)
) ENGINE=InnoDB  DEFAULT CHARSET=utf8 AUTO_INCREMENT=2 ;

--
-- Дамп данных таблицы `users_information`
--

INSERT INTO `users_information` (`id`, `user_id`, `email`, `name`, `post`, `contact`, `content`, `photo`, `modified`) VALUES
(1, 1, 'admin.is@nuft.edu.ua', 'Адміністратор ІС', 'Адміністратор сайту кафедри інформаційних систем', '38(000)000-00-00', '', 'img/users/4227b5a99e0c52d1830ada2144ddae5d.jpeg', '2015-05-18 02:53:15');

--
-- Ограничения внешнего ключа сохраненных таблиц
--

--
-- Ограничения внешнего ключа таблицы `alerts`
--
ALTER TABLE `alerts`
  ADD CONSTRAINT `alerts_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `files`
--
ALTER TABLE `files`
  ADD CONSTRAINT `files_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `menu_items`
--
ALTER TABLE `menu_items`
  ADD CONSTRAINT `menu_items_ibfk_1` FOREIGN KEY (`menu_id`) REFERENCES `menus` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `menu_items_ibfk_2` FOREIGN KEY (`item_id`) REFERENCES `menu_items` (`id`) ON DELETE CASCADE;

--
-- Ограничения внешнего ключа таблицы `news`
--
ALTER TABLE `news`
  ADD CONSTRAINT `news_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `pages`
--
ALTER TABLE `pages`
  ADD CONSTRAINT `pages_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`);

--
-- Ограничения внешнего ключа таблицы `reviews`
--
ALTER TABLE `reviews`
  ADD CONSTRAINT `reviews_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE SET NULL;

--
-- Ограничения внешнего ключа таблицы `users_information`
--
ALTER TABLE `users_information`
  ADD CONSTRAINT `users_information_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
